<?php 
defined('BASEPATH') OR exit('No direct script access allowed');
class If_01 extends CI_Controller
{
    function __construct()
    {
        parent::__construct();
    }

    public function index ()
    {
        /* 
            พิจารณาตัวอย่างโปรแกรมต่อไปนี้โดยต้องการเขียนโปรแกรมภาษา PHP เพื่อคำนวณ
            หาส่วนลดที่ได้จากการซื้อสินค้า และค่าราคาสินค้าสุทธิ โดยกำหนดเงื่อนไขในการ
            ให้ส่วนลด คือ ถ้าลูกค่าซื้อสินค้าเป็นจำนวนเงินมากกว่าหรือเท่ากับ 5,000 บาท
            จะได้รับส่วนลด 3% ของราคาสินค้า และได้กำหนด $price1 และ $price2 คือตัวแปร
            ของราคาสินค้าก่อนหักส่วนลด, $discount คือตัวแปรของส่วนลดที่คำนวณได้
            และ $netprice คือ ตัวแปรของราคาสินค้าหลังจากหักส่วนลด
        */

        $price1 = 7000;
        $price2 = 3000;
        $discount = 0;

        if ($price1 >= 5000)
        {
            $discount = $price1 * 0.03;
        }

        $netprice = $price1 - $discount;
        echo "สินค้า 1 ราคา $price1 บาท<br>";
        echo "ได้รับส่วนลด $discount บาท<br>";
        echo "เพราะฉะนั้น ราคาสินค้าสุทธิเท่ากับ $netprice <br>";
        echo "********************************************** <br>";

        $discount = 0;
        if($price2 >= 5000)
        {
            $discount = $price2 * 0.03;
        }

        $netprice = $price2 - $discount;
        echo "สินค้าที่ 2 ราคา $price2 บาท <br>";
        echo "ได้รับส่วนลด $discount บาท <br>";
        echo "เพราะฉะนั้น ราคาสินค้าสุทธิเท่ากับ $netprice <br>";
    }

    public function if_02 ()
    {
        /* 
            จากรูป ลักษณะการทำงานของคำสั่งตรวจสอบเงื่อนไขแบบ 2 ทางเลือกจะมีนิพจน์
            หลังคำสั่ง if ถ้าเงื่อนไขดังกล่าวมีค่าเป็นจริงก็จะลงมาทำคำสั่งที่อยู่ภายในวงเล็บปิกกาของคำว่า
            if ซึ้งคำสั่งภายในวงเล็กปีกกาจะมีกี่คำสั่งก็ได้ แต่ถ้านิพจน์หลังคำสั่ง if มีค่าเป็นเท็จโปรแกรม
            ก็จะมาทำคำสั่งในวงเล็บปีกกาที่อยู่หลังคำสั่ง else และเช่นเดียวกันคำสั่งภายในวงเล็บปีกกาหลัง
            คำสั่ง else นี้จะมี่กี่คำสั่งก็ได้

            พิจาราณาตัวอย่างโปรแกรมต่อไปนี้โดยต้องการเขียนโปรแกรมภาษา PHP เพื่อคำนวณหาส่วนลด
            ที่ได้จากการซื้อสินค้า และค่าราคาสินค้าสุทธิ โดยกำหนดเงื่อนไขในการให้ส่วนลด คือ ถ้าลูกค้าซื้อ
            สินค้าเป็นจำนวนเงินมากกว่าหรือเท่ากับ 10,000 บาทจะได้รับส่วนลด 5% ของราคาสินค้า แต่ถ้า
            ราคาสินค้าไม่ถึง 10,000 บาทก็จะได้รับส่วนลดเพียง 3% ของราคาสินค้า และได้ กำหนดให้ $price1
            และ $price2 คือตัวแปรของราคาสินค้าก่อนหักส่วนลด, $discount คือตัวแปรของส่วนลดที่คำนวณ
            ได้ และ $netprice คือ ตัวแปรของราคาสินค้าหลังจากหักส่วนลดแล้ว
        */

        $price1 = 12000;
        $price2 = 7000;
        $discount = 0;
        if($price1 >= 10000){
            $discount = $price1 * 0.05;
        }else{
            $discount = $price1 * 0.03;
        }

        $netprice = $price1 - $discount;

        echo "สินค้า 1 ราคา $price1 บาท<br>";
        echo "ได้รับส่วนลด $discount บาท<br>";
        echo "เพราะฉะนั้น ราคาสินค้าสุทธิเท่ากับ $netprice <br>";
        echo "************************************************** <br>";

        $discount = 0;
        if($price2 >= 10000){
            $discount = $price2 * 0.05;
        }else{
            $discount = $price2 * 0.03;
        }

        $netprice = $price2 - $discount;

        echo "สินค้าที่ 2 ราคา $price2 บาท <br>";
        echo "ได้รับส่วนลด $discount บาท <br>";
        echo "เพราะฉะนั้น ราคาสินค้าสุทธิเท่ากับ $netprice <br>";
    }

    public function if_03(){
        /* 
        
        คำสั่งตรวจสอบเงื่อนไขแบบหลายทางเลือกหรือทางเลือกแบบซ้อน
        เป็นลักษณะวางซ้อนๆ กัน ลักษณะในการประมวลผลของคำสั่ง if แบบนี้
        ก็ยังมีลักษณะการทำงานเหมือนเดิม คือหลังคำสั่ง if จะเป็นนิพจน์ให้ตรวจสอบว่า
        จริงหรือเท็จ ถ้านิพจน์มีค่าเป็นจริงก็จะทำคำสั่งในวงเล็บปิกกาที่อยู่ถัดไป แต่ถ้านิพจน์มีค่าเป็น
        เท็จก็จะลงไปทำคำสั่งในวงเล็บปีกกาหลังคำสั่ง else แต่ในกรณีนี้หลังคำสั่ง else จะมีคำสั่ง if
        อีกคำสั่งซ้อนอยู่ ซึ้งเราก็ต้องเริ่มพิจารณาเงื่อนไขหลัง if นี้ตามหลักการเดิมลักษณะคำสั่งจะเป็นเช่นนี้ไปเรื้อยๆ
        จนกระทั้งเงื่อนไขที่ต้องตรวจสอบครบทุกเงื่อนไข
        
        */

        $price1 = 7000; # ทางเลือกที่ 1
        $price2 = 12000; # ทางเลือกที่ 2
        $price3 = 25000; # ทางเลือกที่ 3
        $price4 = 4500; # ทางเลือกที่ 4
       

        if(($price1 >= 5000) && ($price1 <= 10000))
        {
            $discount = $price1 * 0.03;
        }
        elseif (($price1 >= 10001) && ($price1 <= 20000))
        {
            $discount = $price1 * 0.05;
        }
        elseif (($price1 >= 20001))
        {
            $discount = $price1 * 0.1;
        }
        else{
            $discount = 0;
        }

        $netprice = $price1 - $discount;
        echo "สินค้าที่ 1 ราคา $price1 บาท<br>";
        echo "ได้รับส่วนลด $discount บาท <br>";
        echo "เพราะฉะนั้น ราคาสินค้าสุทธิเท่ากับ $netprice <br>";
        echo "*******************************************************<br>";

        if(($price2 >= 5000) && ($price2 <= 10000))
        {
            $discount = $price2 * 0.03;
        }
        elseif(($price2 >= 10001) && ($price2 <= 20000))
        {
            $discount = $price2 * 0.05;
        }
        elseif(($price2 >= 20001))
        {
            $discount = $price2 * 0.1;
        }else{
            $discount = 0;
        }
        $netprice = $price2 - $discount;
        echo "สินค้าที่ 2 ราคา $price2 บาท<br>";
        echo "ได้รับส่วนลด $discount บาท<br>";
        echo "เพราะฉะนั้น ราคาสินค้าสุทธิเท่ากับ $netprice <br>";
        echo "************************************************************ <br>";

        if(($price3 >= 5000) && ($price3 <= 10000))
        {
            $discount = $price3 * 0.03;
        }
        elseif (($price3 >= 10001) && ($price3 <= 20000))
        {
            $discount = $price3 * 0.05;
        }
        elseif (($price3 >= 20001))
        {
            $discount = $price3 * 0.1;
        }
        else{
            $discount = 0;
        }
        $netprice = $price3 - $discount;
        echo "สินค้าที่ 3 ราคา $price3 บาท<br>";
        echo "ได้รับส่วนลด $discount บาท <br>";
        echo "เพราะฉะนั้น ราคาสินค้าสุทธิ $netprice <br>";
        echo "*****************************************************************<br>";

        if(($price4 >= 5000) && ($price4 <= 10000))
        {
            $discount = $price4 * 0.03;
        }
        elseif(($price4 >= 10001) && ($price4 <= 20000))
        {
            $discount = $price4 * 0.05;
        }
        elseif(($price4 >= 20001))
        {
            $discount = $price4 * 0.1;
        }
        else{
            $discount = 0;
        }

        $netprice = $price4 - $discount;
        echo "สินค้าที่ 4 ราคา $price4 บาท<br>";
        echo "ได้รับส่วนลด $discount บาท<br>";
        echo "เพราะฉะนั้น ราคาสินค้าสุทธิเท่ากับ $netprice <br>";
        echo "********************************************************************<br>";

    }
}